[
  {
    "id":1,
    "name": "Veg Fried Rice",
    "ingredients": [
      "2 tbsp Oil",
      "1 Star Anise",
      "2 Dry Red Chillies, broken in half",
      "8-10 Cashew Nuts",
      "1 inch Ginger, chopped",
      "1 tbsp Garlic, chopped",
      "2 tbsp Spring Onion, chopped",
      "¼ cup Carrot, chopped",
      "¼ cup Broccoli, small florets",
      "¼ cup Cabbage, chopped",
      "Salt to taste",
      "½ tsp Black Pepper Powder",
      "½ tbsp Vinegar",
      "1 ½ cups Pre-cooked Rice"
    ],
    "steps": [
      "In a wok or kadai, add oil, let it heat properly and then add star anise, dry red chilli, let it crackle",
      "Then add cashew nut, ginger, garlic saute for a minute.",
      "Now, add spring onion, carrot, broccoli, cabbage and saute on high flames for 3-4 minutes.",
      "Then add salt to taste, black pepper powder, vinegar and mix everything properly and then add the pre-cooked rice",
      "Toss the rice on high flames with light hands and let it cook for 3-4 minutes then serve hot and garnish with spring onion.",
      "Arrange onto serving platter and enjoy!"
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": "https://imgur.com/7xgAPPt"
  },
  {
    "id":2,
    "name": "Lemon Rice",
    "ingredients": [
      "2 tbsp Sesame Oil ",
      "1 tsp Mustard Seeds ",
      "1 tsp Whole Black Gram",
      "1 tsp split chickpeas",
      "1 sprig Curry Leaves ",
      "2 Dry Red Chillies",
      "2-3 fresh Green Chillies – slit in half ",
      "6-8 Cashew Nuts ",
      "8-10 Peanuts ",
      "1 tsp Turmeric Powder",
      "1 medium Lemon Juice ",
      "2 cups Rice",
      "4-5 Curry Leaves ",
      "Salt to taste"
    ],
    "steps": [
      "In a kadai heat sesame oil and add mustard seeds, whole black gram, split chiockpeas and let it get nutty brown.",
      "Now add curry leaves, dry red chillies, green chillies, saute for a minute.",
      "Then add cashew nuts, peanuts, and saute until light golden brown.",
      "Switch off the flames and add turmeric powder, salt, lemon juice and then toss in the rice.",
      "Switch the flames back on and sprinkle some water on the rice, cover and cook for 2-3 minutes.",
      "Remove the lid and crushed minutes of curry leaves and salt, mix it properly and serve warm.",
      "Arrange onto serving platter and enjoy!"
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": "https://imgur.com/AVBgtbs"
  },
  {
    "id":3,
    "name": "French Beans Vegetable",
    "ingredients": [
      "2 tbsp Oil ",
      "1 tsp Cumin Seeds",
      "1 inch Ginger – chopped",
      "3-4 cloves Garlic – chopped ",
      "3 fresh Green Chillies – chopped",
      "1 medium Onion – sliced",
      "½ tsp Asafoetida",
      "½ tsp Turmeric Powder",
      "1 tsp Degi Red Chilli Powder",
      "1 tsp Coriander Powder",
      "1 cup soaked Chana Dal ",
      "2 cups French Beans – cut in 1 inch pieces ",
      " medium Tomato – chopped",
      "Salt to taste ",
      "few Coriander Leaves – roughly torn "
    ],
    "steps": [
      "In a pan heat oil then add cumin seeds, ginger, green chillies, garlic saute a few seconds.",
      "Now add onion saute until translucent then add asafoetida, turmeric powder, degi red chilli powder, coriander powder and saute until fragrant.",
      "Then add soaked chana dal, salt, some water and mix it once then cover and cook for 3-4 minutes.",
      "Now add french beans and mix everything properly then cover and cook for 5-7 minutes.",
      "Remove the lid then add tomatoes and saute for a minute, finish it with chopped coriander leaves and serve hot.",
      "Arrange onto serving platter and enjoy!"
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": "https://imgur.com/VpvcQKE"
  },
  {
    "id":4,
    "name": "Hara Bhara Kebab",
    "ingredients": [
      "1 tsp olive oil",
      "½ cup french beans",
      "½ cup green peas",
      "½ no capsicum/ green bell pepper",
      "½ cup spinach puree",
      "2 potato, boiled",
      "1 tsp ginger, chopped",
      "1 tsp green chili, chopped",
      "2-3 tbsp corn flour",
      "1 tsp cumin powder",
      "1 tsp coriander powder",
      "1 tsp red chili powder",
      "1 tsp garam masala",
      "Salt to taste",
      "Few cashew nuts",
      "Oil for shallow frying"
    ],
    "steps": [
      "Heat oil in kadhai, add vegetables sauté for a minute.",
      "Then add ½ cup of water, cover and cook for 5 minutes on low flame.",
      "When vegetables are cooked, put them in a blender and make a fine paste.",
      "In another bowl add this prepared paste, spinach puree, potato, ginger, green chili, spices, corn flour and mix well.",
      "Take lemon size ball and make tikki. Put one cashewnut on top. Shallow fry them in hot pan from both the sides.",
      "Remove and serve hot."
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": ""
  },
  {
    "id":5,
    "name": "Chilli Garlic Noodles",
    "ingredients": [
      "Water,Salt to taste,",
      "2 pack Noodles",
      "3 tbsp Oil",
      "5-6 cloves Garlic, chopped",
      "1 medium Onion, sliced",
      "1 tsp Red chilli flakes",
      "½ tsp Soy sauce",
      "2 tbsp Tomato ketchup",
      "1 tbsp Vinegar",
      "2 tbsp Chilli oil",
      "1 medium Red bell pepper",
      "2 tbsp Spring onion, chopped",
      "Few Coriander leaves, roughly torn"
    ],
    "steps": [
      "In a sauce pot, add water, salt to taste. Once it starts boiling add noodles,Cover it with the lid and cook on medium flame ",
      "Onces it’s cooked strain the noodles and transfer it into a tray, add oil and mix it well.",
      "Keep it in a refrigerator until it cools down completely",
      "Now,In a wok, add oil, garlic and saute it well.",
      "Add onion, red chilli flakes, saute for a few minutes.",
      "Add soy sauce, tomato ketchup, vinegar, prepared chilli oil and mix it well.",
      "Add boiled noodles and mix it well.",
      "Add green and red bell pepper and toss everything well.",
      "Add spring onion, bhavnagri fresh red chilli, coriander leaves.",
      "Garnish it with coriander leaves and chilli oil",
      "Arrange onto serving platter and enjoy!"
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": "https://imgur.com/i4bLhPE"
  },
  {
    "id":6,
    "name": "Sweet Potato Chaat",
    "ingredients": [
      "2-4 Sweet potato, parboiled, roasted, peeled, diced",
      "¼ cup Melted Butter",
      "Tomato sweet sauce",
      "Salt to taste",
      "1 inch Ginger, chopped",
      "2-3 Green chilli, chopped",
      "Few Coriander leaves, chopped",
      "1 large Onion, chopped",
      "Few Puffed rice"
    ],
    "steps": [
      "Place the parboiled sweet potato on semi hot coal and roast it from all the sides properly.",
      "Onces the potatoes are cool enough to handle, peel them and cut into dice and keep aside for future use.",
      "n a bowl, add ginger, green chillies, onion, coriander leaves and mix it well and keep aside for future use.",
      "Heat butter in a shallow pan, add sweet potato and fry until nice crisp from all the sides.",
      "Onces it’s done transfer it into a bowl and keep aside for future use.",
      "In the same pan, add prepared tomato red sauce and saute for a minute.",
      "Add a little water and mix it well. Add salt to taste, add fried sweet potato and toss it well.",
      "Add the chopped onion green chilli mixture and puffed rice and mix it well.",
      "Garnish it with puffed rice and coriander sprig and serve warm.",
      "Arrange onto serving platter and enjoy!"
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": "https://imgur.com/CM2EYUY"
  },
  {
    "id":7,
    "name": "Onion Cheese Pakoda",
    "ingredients": [
      "2 Cups Onion, sliced",
      "½ tsp Turmeric Powder ",
      "2 tsp Red Chili Powder",
      "½ tsp Ajwain",
      "1 tsp Ginger, chopped",
      "1 Green Chili, chopped",
      "½ Cup Besan/ Gram Flour",
      "¼ Cup Rice Flour, optional",
      "5 tbsp Water",
      "Oil, for deep frying",
      "3-4 cheese cubes, cut into bite sized pieces",
      "Salt, to taste"
    ],
    "steps": [
      "In a bowl combine onion, turmeric powder, red chili powder, ajwain, ginger, green chili and mix well.",
      "Season with salt. Add besan, rice flour, water and make a thick batter.",
      "Dip the cheese cubes and coat well with the prepared batter.",
      "Heat oil for deep frying in a pan.",
      "Divide into portions and deep fry the pakodas in oil till brown and crisp.",
      "Remove on absorbent paper and drain off the excess oil.",
      "Serve hot with green chutney."
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": "https://imgur.com/a42pmVC"
  },
  {
    "id":8,
    "name": "honey garlic butter roasted carrots",
    "ingredients": [
      "2 pounds (1 kg) carrots washed and peeled (or unpeeled)",
      "1/3 cup butter",
      "3 tablespoons honey",
      "4 garlic cloves minced",
      "1/4-1/2 teaspoon salt plus more for seasoning",
      "Cracked black pepper",
      "2 tablespoons fresh chopped parsley"
    ],
    "steps": [
      "Preheat oven to 425°F (220°C). Lightly grease a large baking sheet with nonstick cooking oil spray; set aside.",
      "Trim ends of carrots and cut into thirds.",
      "Melt butter in a pan or skillet over medium-heat. Pour in honey and cook, while stirring, until completely melted through the butter. Add the garlic and cook for 30 seconds until fragrant while stirring.",
      "Add the carrots and allow the sauce to thicken for a further minute, while tossing the carrots through the sauce. Season with salt and pepper. ",
      "Transfer carrots to baking sheet in a single layer so they cook evenly. Toss to evenly coat.",
      "Roast for 20 minutes, or until carrots are fork-tender. Broil (or grill) for 2-3 minutes on high heat to crisp/char the edges.",
      "OPTIONAL: Transfer them back into the skillet and allow carrots to simmer in the sauce over high heat for 5 minutes to thicken the sauce into a glaze. *SEE NOTES.",
      "Season with a little extra salt and pepper if desired. Garnish with parsley.",
      "Arrange onto serving platter and enjoy!"
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": "https://imgur.com/jL2tsND",
    "videoURL": "https://youtu.be/qYfoARhooHE"
  },
  {
    "id":9,
    "name": "creamy mashed potatoes ",
    "ingredients": [
      "2 pounds (1kg) potatoes, (Russet, Yukon Gold, Dutch Creams, Creme Gold, Creme Royale)",
      "1 teaspoon salt",
      "1/2 cup hot milk, or more",
      "1/3 cup unsalted butter, softened (close to room temp is best)",
      "6-8 cloves fresh garlic finely chopped",
      "1/4 cup sour cream",
      "1/4 cup fresh shredded parmesan cheese, optional",
      "Salt and Pepper, to taste",
      "1 tablespoon fresh chopped parsley to garnish, optional to garnish"
    ],
    "steps": [
      "Peel and cut potatoes into quarters lengthwise. Remove any spots, lumps or knots.",
      "Place potatoes in a large pot (6-quart) and cover with cold, salted water by an inch. Bring to a boil, reduce heat down to medium-low and allow to simmer until fork tender (about 15-20 minutes).",
      "When potatoes are just about done (nearly fork-tender), heat 1 tablespoon of the butter in a small pan over medium-high heat. Sauté garlic until fragrant, about 1 minute. Set aside and keep warm",
      "Drain cooked potatoes, add in the remaining butter, cooked garlic, hot milk and sour cream.",
      "Mash the potatoes with a potato masher until smooth, adding a little extra milk if needed. ",
      "Add in the parmesan cheese. Season with salt and pepper to taste."
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": "https://imgur.com/Sou4Z5E",
    "videoURL": ""
  },
  {
    "id": 10,
    "name": "Crock Pot Roast",
    "ingredients": [
      "1 beef roast",
      "1 package brown gravy mix",
      "1 package dried Italian salad dressing mix",
      "1 package dry ranch dressing mix",
      "1/2 cup water"
    ],
    "steps": [
      "Place beef roast in crock pot.",
      "Mix the dried mixes together in a bowl and sprinkle over the roast.",
      "Pour the water around the roast.",
      "Cook on low for 7-9 hours."
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": "http://img.sndimg.com/food/image/upload/w_266/v1/img/recipes/27/20/8/picVfzLZo.jpg"
  },
  {
    "id": 11,
    "name": "Chicken Tenders",
    "ingredients": [
      "1 large egg,2 tablespoons olive oil",
      "2 tablespoons lemon juice",
      "1 tablespoon fresh chopped parsley",
      "2 teaspoons minced garlic",
      "3/4 teaspoon salt to season",
      "1/4 teaspoon cracked black pepper",
      "28 ounces (800 g) chicken tenders",
      "1 cup Panko breadcrumbs",
      "1/2 cup regular breadcrumbs (garlic, herb or Italian seasoned for extra flavour)",
      "1 teaspoon mild paprika (or sweet, smoky, spicy)",
      "1/2 teaspoon garlic powder",
      "1/2 teaspoon onion powder",
      "1/4 cup fresh grated parmesan cheese"
    ],
    "steps": [
      "Preheat oven to 400°F (200°C). Lightly grease a baking tray / sheet with cooking oil spray, or a light coating of oil. Set aside.",
      "In a large bowl, whisk together the egg, oil, lemon juice, parsley, garlic, salt and pepper.",
      "Dip chicken tenders into egg mixture and let sit for 5 minutes while preparing crumb mixture. ",
      "In another bowl, combine both breadcrumbs, paprika, garlic powder, onion powder and parmesan cheese.",
      "Dredge the egg coated chicken in the breadcrumb/parmesan mixture, lightly pressing to evenly coat.",
      "Arrange tenders on the baking sheet / tray and lightly spray with cooking oil spray. ",
      "Bake for 10 minutes. Flip and bake for a further 5-10 minutes or until cooked through. (Broil in the last 2-3 minutes for a golden crispy crumb!)"
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": "https://imgur.com/djWF5zT",
    "videoURL": "https://youtu.be/B3DEtmdw3-E"
  },
  {
    "id": 12,
    "name": "garlic herb butter roast chicken",
    "ingredients": [
      "4 pound (2kg) whole chicken,",
      "1/4 cup unsalted butter, melted",
      "1/4 cup white wine",
      "1 lemon, halved",
      "Salt and freshly ground pepper, to taste",
      "2 tablespoons fresh chopped parsley",
      "4 garlic cloves, minced",
      "1 head of garlic roughly peeled and cut in half horizontally through the middle crosswise",
      "3 fresh whole rosemary sprigs"
    ],
    "steps": [
      "Preheat oven to 430°F | 220°C (400°F or 200°C fan forced). Line a baking tray with foil, or lightly grease a roasting pan.",
      "Discard neck from inside the cavity and remove any excess fat and leftover feathers. Pat dry with paper towels.",
      "Pour the olive oil, melted butter, wine (if using) and the juice of half a lemon over the chicken, under the skin and inside the cavity. Season chicken liberally on the outside and inside the cavity with salt and pepper. Sprinkle over the parsley.",
      "Rub the minced garlic over the chicken, mixing all ingredients together over the chicken and under the skin.",
      "Stuff the garlic head into the chicken cavity along with the rosemary sprigs and the squeezed lemon halve. Tie legs together with kitchen string.",
      "Place breast-side up into baking tray or roasting pan. Roast for 1 hour and 15-20 minutes, basting half way through cooking time, until juices run clear when chicken thigh is pierced with a skewer. ",
      "Baste again, then broil for a further 2-3 minutes, until golden.",
      "Remove from the oven, cover with foil and allow to stand for 10 minutes before serving. Serve, drizzled with pan juices and remaining lemon half cut into wedges or slices."
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": "https://imgur.com/s785FYB",
    "videoURL": "https://youtu.be/nZBuqMc7Njs"
  },
  {
    "id": 13,
    "name": "CREAMY GARLIC PARMESAN BROCCOLI & BACON",
    "ingredients": [
      "8 ounces (250 g) bacon roughly chopped",
      "2 tablespoons butter",
      "1 onion diced",
      "5 cloves garlic finely chopped",
      "1 1/2 cups (400 ml) light cream (or for a richer sauce, you can use heavy or thickened cream)",
      "1 1/2 teaspoons cornstarch mixed with 1 tablespoon water cornstarch slurry",
      "1 pound (500 g) broccoli florets, from 2-3 broccoli heads -- stems removed Salt and pepper to season",
      "1/2 cup fresh shredded or grated mozzarella",
      "1/3 cup fresh shredded or grated parmesan cheese"
    ],
    "steps": [
      "Preheat broiler (on medium heat).",
      "Fry the bacon in a large oven-safe skillet over medium heat until crispy. Use a slotted spoon to transfer to a paper towel lined plate to soak up some of the oil. Set aside.",
      "Drain most of the bacon fat from the pan, leaving about 1-2 tablespoons for added flavour (adjust this amount to your liking). In the same pan, melt the butter, add the onion and cook until transparent (about 2 minutes), while scraping up any browned bits leftover from the bacon. Add the broccoli and season with salt and pepper and cook while stirring occasionally for about 3 minutes, or until just turning vibrant in colour.",
      "Add in the garlic and stir it through the broccoli for 30 seconds, until fragrant. Pour in the cream, reduce heat down to low and let simmer for about 3-4 while stirring occasionally, or until the sauce thickens to your likin",
      "Add the bacon and give everything a good mix to combine all of the flavours together. Top with the mozzarella and parmesan cheeses. Broil until cheese is bubbling and golden, and broccoli is done to your liking (about 2-3 minutes).",
      "Season with a little extra pepper, if desired, before serving. You can also sprinkle with fresh chopped parsley, thyme or rosemary"
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": "https://imgur.com/pXSdcA5",
    "originalURL": "https://youtu.be/TMnx8KRWy6o"
  },
  {
    "id": 14,
    "name": "MOZZARELLA STUFFED CHICKEN PARMESAN",
    "ingredients": [
      "4 boneless skinless chicken thighs,",
      "Pinch of salt, to taste",
      "4 tablespoons garlic and herb flavoured tomato paste",
      "2 teaspoons dried parsley",
      "2 teaspoons garlic powder",
      "1 teaspoon salt, divided",
      "8 thin slices Mozzarella cheese, divided",
      "1 egg",
      "1 teaspoon garlic powder",
      "1/4 cup breadcrumbs",
      "1/4 cup panko breadcrumbs",
      "1 teaspoon dried basil",
      "2 tablespoons grated parmesan cheese",
      "2 teaspoons olive oil",
      "1 bottle Pasta/Marinara Sauce"
    ],
    "steps": [
      "Preheat oven to 450°F (230°C). Lightly pound fillets between two pieces of plastic wrap to 1/4-inch thickness using a mallet. Pat chicken dry; season with salt.",
      "Spread 1 tablespoon tomato paste over one side of each fillet; sprinkle with parsley, garlic powder and 1/2 teaspoon of salt. Place one slice of mozzarella onto each half of a fillet and roll (starting from the cheese end) and place seam side down.",
      "In a shallow medium-sized bowl, whisk the the egg, garlic powder and remaining 1/2 teaspoon of salt together; set aside. In another shallow bowl, combine the breadcrumbs, panko, basil and parmesan cheese.",
      "Heat the olive oil in a 12-inch cast iron skillet (or oven-proof frying pan) over medium heat. Evenly coat the rolled chicken fillets into the egg mixture, then into the breadcrumb mixture.",
      "Place the chicken (seam side down again) into the preheated skillet/pan and cook on each side for 4-5 minutes until the coating is golden brown and the cheese on the inside has melted.",
      "Reduce heat to low and pour in the pasta sauce. Move the chicken around with tongs so the sauce is evenly covered over the base of the pan; allow to simmer for 1-2 minutes until fragrant.",
      "Pour some sauce from the pan over each chicken; place skillet/pan in the oven to cook for a further 10 minutes. Remove pan from oven; top each chicken roll with remaining cheese slices; return to oven and allow to grill/broil on medium heat until cheese has melted over the top. Garnish with extra dried parsley and Italian herbs.",
      "Serve warm over pasta; mashed potatoes or with a salad."
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": "https://imgur.com/BEuLvHD"
  },
  {
    "id": 15,
    "name": "2 INGREDIENT PESTO CHICKEN",
    "ingredients": [
      "4 skinless and boneless chicken breast fillets (about 1 kg | 2 pounds)",
      "1/2 cup Basil Pesto , plus 1/4 cup extra for serving (use this recipe for homemade pesto or you can use store bought)",
      "Salt and Pepper to season ",
      "500 g | 17 ounces cherry tomatoes"
    ],
    "steps": [
      "Smother chicken fillets in the pesto on all sides (about 2 tablespoons of pesto for each chicken breast, depending on your taste). ",
      "Preheat a barbecue plate, grill pan or skillet over medium-high heat. Cook for 5-6 minutes each side or until completely cooked through.",
      "Top chicken with extra pesto. Serve with the tomatoes",
      "Preheat the oven to 350°F | 180°C. Line a baking dish with aluminium foil or bang | parchment paper.",
      "Arrange the coated chicken breasts in the baking dish and bake in a preheated oven for 30 minutes.",
      "At 30 minutes, remove the chicken from the oven and arrange the tomatoes around each fillet.",
      "Place the chicken back in the oven and cook a further 20 minutes, or until the chicken is cooked through and no longer pink."
    ],
    "timers": [
      0,
      0,
      0,
      420
    ],
    "imageURL": "https://imgur.com/kAuDKnt"
  },
  { 
    "id": 16,
    "name": "Quick Chicken Parmesan",
    "ingredients": [
      "2 8-ounce boneless, skinless chicken breasts, trimmed",
      "½ teaspoon freshly ground pepper, divided",
      "½ cup coarse dry breadcrumbs, preferably whole-wheat (see Tip)",
      "2 tablespoons freshly grated Parmesan cheese",
      "3 tablespoons extra-virgin olive oil, divided",
      "1 medium onion, chopped",
      "3 cloves garlic, minced",
      "1 28-ounce can no-salt-added crushed tomatoes",
      "1 teaspoon Italian seasoning",
      "½ teaspoon salt",
      "1 cup shredded part-skim mozzarella cheese",
      "¼ cup chopped fresh basil or parsley"
  
    ],
    "steps": [
      "Cut each chicken breast in half on the diagonal to make 4 roughly equal portions. Place between pieces of plastic wrap and pound with the smooth side of a meat mallet or a heavy saucepan to an even 1/4-inch thickness. Sprinkle the chicken with 1/4 teaspoon pepper. Combine breadcrumbs. Parmesan and 1 tablespoon oil in a small bowl; set aside.",
      "Position rack in upper third of oven; preheat broiler to high.",
      "Heat 1 tablespoon oil in a large, ovenproof skillet over medium-high heat. Add half the chicken and cook until golden, 2 to 3 minutes per side. Transfer to a plate. Reduce the heat to medium and repeat with the remaining 1 tablespoon oil and chicken. Transfer the chicken to the plate.",
      "Add onion and garlic to the pan and cook, stirring, until beginning to soften, 2 to 3 minutes. Remove the pan from the heat. Pour in crushed tomatoes; add Italian seasoning, salt and the remaining 1/4 teaspoon pepper. Return the pan to medium heat and cook, stirring, until the onions are tender, 2 to 3 minutes. Return the chicken and any accumulated juices to the pan. Turn to coat with the sauce.",
      "Sprinkle about 1/4 cup of mozzarella cheese over each piece of chicken, then top with the reserved breadcrumb mixture. Broil until the cheese is melted, about 1 minute. (Watch carefully to prevent burning.) Serve the chicken with the sauce, sprinkled with basil (or parsley)."
    ],
    "timers": [0, 0, 0, 420],
    "imageURL": "https://res.cloudinary.com/dppglrm2s/image/upload/v1621870669/id16_qhta7x.jpg"
   

  },
  {
    "id": 17,
    "name": "Quick Roast Chicken & Root Vegetables",
    "ingredients": [
      "1 pound turnips, peeled and cut into 1/2-inch chunks",
      "1 pound baby potatoes, quartered",
      "2 tablespoons extra-virgin olive oil, divided",
      "1 tablespoon chopped fresh marjoram or 1 teaspoon dried",
      "¾ teaspoon salt, divided",
      "½ teaspoon freshly ground pepper, divided",
      "¼ cup all-purpose flour",
      "1 cup reduced-sodium chicken broth",
      "2 bone-in chicken breasts (12 ounces each), skin and fat removed, cut in half crosswise",
      "1 large shallot, chopped",
      "1 tablespoon Dijon mustard",
      "2 teaspoons red- or white-wine vinegar"
  
    ],
    "steps": [
      "Preheat oven to 500 degrees F.",
      "Toss turnips, potatoes, 1 tablespoon oil, marjoram, 1/2 teaspoon salt and 1/4 teaspoon pepper together in a medium bowl. Spread in an even layer on a large baking sheet. Roast for 15 minutes.",
      "Meanwhile, place flour in a shallow dish. Transfer 2 teaspoons of the flour to a small bowl and whisk in broth; set aside. Season chicken with the remaining 1/4 teaspoon salt and 1/4 teaspoon pepper. Dredge the chicken in the flour, shaking off excess. (Discard any leftover flour.)",
      "Heat the remaining 1 tablespoon oil in a large skillet over medium heat. Add the chicken, skinned-side down, and cook until well browned on the bottom, about 5 minutes. Remove from the heat.",
      "After the vegetables have been roasting for 15 minutes, stir them and place one piece of chicken, skinned-side up, in each corner of the baking sheet. (Set the skillet aside.) Return the vegetables and chicken to the oven and roast until the chicken is cooked through and the vegetables are tender, about 20 minutes more.",
      "When the chicken and vegetables have about 10 minutes left, return the skillet to medium heat. Add shallot and cook, stirring, until fragrant, about 1 minute. Whisk the reserved broth mixture again, add to the pan and bring to a boil. Cook, stirring occasionally, until reduced by about half, about 8 minutes. Stir in mustard and vinegar. Serve the chicken and vegetables with the sauce."
    ],

    "timers": [0, 0, 0, 420],
    "imageURL": "https://res.cloudinary.com/dppglrm2s/image/upload/v1621870426/id17_kmlvhb.jpg"
   
  },
  {
    "id": 18,
    "name": "Whole Roasted Lemon-Herb Chicken on a Bed of Vegetables",
    "ingredients": [
      "¼ cup fresh sage leaves, divided",
      "¼ cup fresh thyme sprigs, divided",
      "2 lemons, divided",
      "2 teaspoons minced garlic",
      "2 tablespoons extra-virgin olive oil, divided",
      "1 teaspoon salt, divided",
      "¾ teaspoon freshly ground pepper, divided",
      "1 small onion, quartered",
      "1 4- to 4 1/2-pound chicken",
      "4 large carrots, cut into 1/2-inch chunks",
      "3 medium turnips, peeled (see Tip) and cut into 1/2-inch cubes",
      "2 celeriac roots (1 1/2-2 pounds total), peeled (see Tip) and cut into 1/2-inch cubes"
    ],

    "steps": [
      "Position rack in lower third of oven; preheat to 400F.",
      "Chop 8 sage leaves and place in a bowl with 2 teaspoons thyme leaves. Squeeze the juice from 1 lemon into the bowl. Add garlic, 1 tablespoon oil, 3/4 teaspoon salt and 1/2 teaspoon pepper; mix well. Set aside.",
      "Pierce the remaining lemon all over with a sharp fork. Cram the lemon, onion and the remaining sage and thyme into the chicken cavity.",
      "Place the chicken breast-side up on a cutting board. Use your hands to gently loosen the skin covering the breast, thighs and the top end of the drumsticks. Smear the lemon-herb mixture under the skin, covering as much of the meat as possible.",
      "Toss carrots, turnips and celeriac in a large bowl with the remaining 1 tablespoon oil and 1/4 teaspoon each salt and pepper until well coated.",
      "Place the chicken breast-side up in a large roasting pan (but not on a rack). Scatter the vegetables around the chicken. Bake, stirring the vegetables occasionally, until an instant-read thermometer inserted into the thickest part of a thigh without touching bone registers 165 degrees F, 1 to 1 1/4 hours.",
      "Transfer the chicken to a clean cutting board and let rest for 10 minutes before carving. Transfer the vegetables from the roasting pan to a serving dish with a slotted spoon, leaving behind as much of the fat as possible. Serve the chicken with the vegetables."
    ],
    "timers": [0, 0, 0, 420],
    "imageURL": "https://res.cloudinary.com/dppglrm2s/image/upload/v1621870139/id18_l7ri7g.jpg"
  }
  {
    "id": 19,
    "name": "Baked Chicken with Onions & Leeks",
    "ingredients": [
      "2 cups thinly sliced onions",
      "1 cup thinly sliced and washed leek, white and light green part only",
      "4 cloves garlic, thinly sliced",
      "3 tablespoons extra-virgin olive oil, divided",
      "2 teaspoons fresh thyme leaves",
      "¼ teaspoon salt",
      "2 1/2-3 pounds bone-in chicken pieces (thighs, drumsticks and/or breasts), skin removed, trimmed (see Tip)"
    ],

    "steps": [
      "Preheat oven to 400F.",
      "Toss onions, leek, garlic, 2 tablespoons oil, thyme and salt in a large bowl until the vegetables are well coated. Spread the mixture in a nonreactive 9-by-13-inch baking dish (see Tip). Place the chicken pieces on the vegetables. Bake for 10 minutes.",
      "Whisk mustard, shallot, rosemary, soy sauce and pepper in a small bowl; gradually whisk in the remaining 1 tablespoon oil.",
      "After 10 minutes, brush the chicken with the mustard glaze. Continue baking until an instant-read thermometer inserted into the thickest part of a leg or breast (without touching bone) registers 165 degrees F, 30 to 45 minutes more. Serve the chicken with the vegetables."
    ],
    "timers": [0, 0, 0, 420],
    "imageURL": "https://res.cloudinary.com/dppglrm2s/image/upload/v1621869777/id19_uyopso.jpg"
  }
  {
    "id": 20,
    "name": "Garlic Chicken",
    "ingredients": [
      "2 heads garlic, cloves separated",
      "8 chicken drumsticks (about 2 1/2 pounds), skin removed, trimmed",
      "½ teaspoon salt, divided",
      "¼ teaspoon freshly ground pepper",
      "3 tablespoons extra-virgin olive oil",
      "⅓ cup white wine",
      "1 cup reduced-sodium chicken broth",
      "2 teaspoons Dijon mustard",
      "2 teaspoons all-purpose flour",
      "1/3 cup chopped fresh chives or scallion greens"
    ],

    "steps": [
      "Lightly smash garlic cloves with the side of a large knife to loosen the skins. Peel; cut larger ones in half. Sprinkle chicken with 1/4 teaspoon salt and pepper.",
      "Heat oil in a large skillet over medium heat. Add the garlic and cook, stirring, until beginning to brown, about 2 minutes. Remove to a plate with a slotted spoon.",
      "Add chicken to the pan and cook until browned on one side, about 4 minutes. Turn it over and return the garlic to the pan. Add wine and cook for 1 minute.",
      "Whisk broth, mustard, flour and the remaining 1/4 teaspoon salt in a small bowl. Add the mixture to the pan; bring to a boil, then reduce the heat to maintain a lively simmer. Cover and cook until the chicken is cooked through, 8 to 10 minutes. Serve sprinkled with chives (or scallion greens)."
    ],
    "timers": [0, 0, 0, 420],
    "imageURL": "https://res.cloudinary.com/dppglrm2s/image/upload/v1621869329/id20_epxzlq.jpg"
  }

  {
    "id": 21,
    "name": "Fish & Seafood Cataplana",
    "ingredients": [
      "1 and 3/4 lbs of different types of fish",
      "1/4 lb of shrimp in shell",
      "1/4 lb of mussels in half shell",
      "4 potatoes",
      "5 tomatoes",
      "1 green bell pepper",
      "1 onion",
      "3 cloves of garlic",
      "3/4 cup of white wine",
      "4 tablespoons of olive oil",
      "1 tablespoon of Worcestershire sauce",
      "Juice of 1 lemon",
      "1 bay leaf",
      "Salt and pepper (to taste)",
      "Chopped parsley (to taste)"
    ],
    "steps": [
      "Arrange and cut the fish into pieces, place in a bowl and season with the lemon juice, the white wine, salt and pepper andmarinate for 20 minutes.",
      "Meanwhile, peel and wash the onion and garlic cloves, cut the onions into slices and chop the garlic.",
      "Wash the tomatoes and cut them into slices.",
      "Wash, clean and cut the green bell pepper into strips.",
      "Wash and peel the potatoes and cut them into slices.",
      "In the cataplana pot, place the onion, garlic, tomato, pepper, potatoes, drained fish, the mussels, shrimp and bay leaf, drizzle with the marinade from the fish, next add Worcestershire sauce over it and the olive oil.",
      "Cover and simmer for 35 minutes over medium low heat, lightly shaking the cataplana from time to time.",
      "Make sure everything is well cooked, remove from the heat and serve sprinkled with chopped parsley."
    ],
    "timers": [0, 0, 0, 420],
    "imageURL": "https://portugueserecipes.ca/uploads/190504065103.jpg"
  },
  {
    "id": 22,
    "name": " FISH STEW (CALDEIRADA DE PEIXE)",
    "ingredients": [
      "1 cup white wine",
      "3 tbsp tomato paste",
      "1 tsp paprika",
      "1/4 cup olive oil",
      "6 lbs fresh grouper cut in steaks (feel free to use another favourite white fish like conger or cod)",
      "1 large cooking onion sliced thin",
      "5 cloves garlic sliced thin",
      "1 tbsp kosher salt 1/2 tbsp if using fine salt",
      "1 tsp cumin",
      "1/2 tsp ground cinnamon",
      "2 medium tomatoes sliced into thin wheels",
      "1 large bell pepper sliced into thin wheels",
      "2 bay leaves",
      "8 sprigs of fresh flat leaf (Italian) parsley with most of the stem cut off"
    ],
    "steps": [
      "In a measuring cup with a spout, whisk together the wine, tomato paste and 1 tsp paprika, until well combined.",
      "Pour the olive oil into the bottom of a large dutch oven or heavy pot.",
      "Spread half of the sliced onions and garlic evenly over the oil and bottom of the pot.",
      "Place half of the fish steaks over the onions and garlic, in one layer.",
      "Sprinkle 1/3 of the salt, cumin and cinnamon evenly over the fish.",
      "Place the tomato and pepper sliced wheels evenly over the fish.",
      "Spread the remaining half of the sliced onions and garlic evenly over the tomato and pepper slices.",
      "Place the remaining half of the fish steaks over the onions and garlic, in one layer.",
      "Sprinkle 1/3 of the salt, cumin and cinnamon evenly over the fish.",
      "Place the remaining tomato and pepper sliced wheels evenly over the fish.",
      "Sprinkle the remaining salt, cumin and cinnamon over the tomatoes and peppers.",
      "Add the two bay leaves.",
      "Pour the wine mixture over the ingredients in the pot.",
      "Place the pot on the stove and turn the heat up to medium high.",
      "Once the liquid starts to bubble, cover the pot with the lid and reduce the heat to low.",
      "Let simmer for about 30 minutes or until the fish starts to flake.",
      "Turn off the heat, uncover the pot, and add the sprigs of fresh parsley over the cooked ingredients.",
      "Serve hot with steamed/boiled potatoes, rice or a green salad… and a good cup of red wine"
    ],
    "timers": [0, 0, 0, 420],
    "imageURL": "https://www.photosandfood.ca/wp-content/uploads/2020/05/DSC00845-2.jpg.webp"
  },
  {
    "id": 23,
    "name": "Grilled codfish",
    "ingredients": [
      "Codfish",
      "Olive oil",
      "3 garlic cloves",
      "4 potatoes with the peel",
      "Parsley (optional)",
      "Salt and pepper (to taste)"
    ],
    "steps": [
      "Place the codfish in a bowl and cover it with ground pepper. Place it in the refrigerator for a few hours.",
      "Drain the codfish and remove the excess of pepper with paper towels if needed.",
      "Grill the cod (15 to 20 minutes or until cooked) switching sides half way.",
      "Boil the potatoes in water with salt to taste.",
      "Fry the garlic in olive oil and set aside.",
      "Punch each boiled potato to open them a little.",
      "Serve the codfish accompanied by the potatoes, bread, roasted peppers or a salad. You can also try these sauces.",
      "Drizzle with the olive oil and fried garlic and enjoy!"
    ],
    "timers": [0, 0, 0, 420],
    "imageURL": "https://www.bbqs-algarve.com/wp-content/uploads/2020/07/Portuguese-grilled-codfish-recipe.jpg"
  },
  {
    "id": 24,
    "name": "Fish Soup",
    "ingredients": [
      "2 pounds fresh fish of your choice (salmon, seabass, fresh cod, monkfish...)",
      "1/2 pound tiger prawns",
      "5 table spoons olive oil",
      "1 carrot",
      "2 potatoes",
      "1 onionshopping list",
      "4 garlic cloves",
      "1 pound good red tomatoes (peeled)",
      "1 red chili (if you like it)",
      "1/2 pint white wine",
      "coriander leaves",
      "salt",
      "pepper",
      "6 pints water to boil the fish and prawn (add more later if needed)"
    ],
    "steps": [
      "Boil the fish and the prawns in water seasoned with salt and bay leaf.",
      "Use a big pot and start cooking the chopped onion, garlic and carrot in olive oil. Let it be in low heat for 10 minutes stirring occasionally so it doesn't burn.",
      "Add the skinless potato in cubes, the tomato and the wine. Let it cook for 10 minutes and don't forget to stir.",
      "Save the boiled fish water and add to your vegetables.",
      "Taste it and season again if needed. It's time to add the chili pepper.",
      "While you let the soup cook, get rid of the fish bones.",
      "45 minutes later take the chili and the bay leaf and use a hand blender to transform your veggies and water into a nice broth.",
      "After blended add the fish, prawns and chopped coriander leaves.",
      "Cook for 10 minutes more and serve."
    ],
    "timers": [0, 0, 0, 420],
    "imageURL": "http://s2.grouprecipes.com/images/recipes/original/2221747064.JPG"
  },
  {
    "id": 25,
    "name": "Portuguese fish and chips-bacalhau a bras",
    "ingredients": [
      "1 pound dried salt cod",
      "7 tablespoons olive oil, divided",
      "1 1/2 pounds russet potatoes, peeled, cut into matchstick-size strips (about 6 cups)",
      "1 large onion, thinly sliced",
      "8 large eggs",
      "1/2 teaspoon salt",
      "1/2 teaspoon ground black pepper",
      "4 tablespoons chopped fresh parsley, divided",
      "some green or black olives"
    ],
    "steps": [
      "Rinse the fish and place it in a bowl. Add enough cold water to cover. Chill overnight, changing the water several times.",
      "The next day, drain the fish and transfer to a large saucepan. Cover with water, bring to a boil, and simmer until the fish flakes easily, about 15 minutes.Drain and cool. Flake the fish, discarding any bones.",
      "Heat 4 tablespoons of the oil in a heavy, large nonstick skillet over medium-high heat. Add the potatoes in batches and sauté until crisp and golden, about 7 minutes per batch. Transfer the potatoes to paper towels to drain.",
      "Add 1 tablespoon of the oil to the same skillet. Add the onion and and sauté until golden, about 15 minutes. Reduce the heat to low. Add the remaining 2 tablespoons oil to the onion slices in the skillet.",
      "Mix in the fish and potatoes. Whisk the eggs, the 1/2 teaspoon salt, and the 1/2 teaspoon pepper in a large bowl to blend. Add the egg mixture the skillet.",
      "Cook over medium heat until the eggs are softly set, stirring occasionally, about 3 minutes. Transfer onto a platter.",
      "Garnish with the olives and the parsley.And serve with some salad."
    ],
    "timers": [0, 0, 0, 420],
    "imageURL": "https://en.petitchef.com/imgupl/recipe/portuguese-fish-and-chips-bacalhau-a-bras--md-266404p432650.jpg"
  },
  {
    "id": 26,
    "name": "Fish and Pasta Stew",
    "ingredients": [
      "2 Tbsp olive oil",
      "1 onion medium, finely chopped",
      "3 cloves garlic minced",
      "1 cup leeks sliced, soaked and clean (or carrots)",
      "¾ cup crushed tomatoes or ½lb (250g) fresh tomatoes, diced",
      "1 l shrimp or seafood broth (about 1 qt, 32oz) homemade or store-bought",
      "1-2 cup water boiling",
      "1 ⅓ cup pasta macaroni or small shells (about ½lb)",
      "400 g fish fillets haddock, cod, halibut, salmon or another fish of your liking (about 1 lb, cut into bite-size pieces)",
      "200 g shrimp (about ½lb) peeled and deveined, optional",
      "salt and pepper to taste",
      "¼ cup cilantro or parsley, chopped"
    ],
    "steps": [
      "Season the fish (and shrimp, if using) with salt and pepper and set aside. Chop the onion and the garlic. Heat the broth and water.",
      "Bring a pan to medium heat, heat the oil, add the onion and sauté until it begins to brown.",
      "Add the garlic, mix and cook for 1 minute. Add the leeks and cook until tender.",
      "Add the tomatoes and let everything simmer for a few minutes to develop the flavours. Add the broth and 1 cup of water (both hot), taste and adjust the seasoning with salt and a pinch of black pepper.",
      "Bring to a boil and add the pasta. Mix and cook over medium-high heat, stirring occasionally (so the macaroni doesn't stick to the bottom), until the pasta is soft (about 10-12 minutes). If you want the stew with more broth, add more hot water (and check the seasoning) until you get the consistency you prefer.",
      "Add the fish (and the shrimp, if using), mix and cook for another 3-5 minutes, until the fish is opaque and flakes easily. Ideally, the fish should break up a little in the broth to combine more with the pasta.",
      "Turn off the heat, sprinkle with the cilantro (or parsley), stir, and it's ready to serve!"
    ],
    "timers": [0, 0, 0, 420],
    "imageURL": "https://i1.wp.com/www.vivahappy.com/wp-content/uploads/2020/04/20200422_135154-scaled.jpg?resize=1400%2C400&ssl=1"
  }

]